package com.company;

public class Ptv extends Questions {
    public Ptv() {
        arrayPtv[0] = "СПРК - ствол переносной, ручной, комбинированный";
        arrayPtv[1] = "СПРК - ствол пожарный, ручной, комбинированный";
        arrayPtv[2] = "СПРК-8Б: 8- максимальный расход воды л.с, \"Б\"- тип присоединения, под рукавную головку ГР-60";
        arrayPtv[3] = "СПРК-8Б: 8- максимальный расход воды (раствора) л.с, \"Б\"- тип присоединения, под рукавную головку ГР-50";
        arrayPtv[4] = "Рабочее давление СПРК-8Б составляет - 0.6 мПа";
        arrayPtv[5] = "Рабочее давление СПРК-8Б составляет - 0.7 мПа";
        arrayPtv[6] = "Расход воды (раствора) СПРК-8Б составляет - 2,5,6,7 л.с";
        arrayPtv[7] = "Расход воды (раствора) СПРК-8Б составляет - 2,4,6,8 л.с";
        arrayPtv[8] = "Дальность водяной, сплошной струи СПРК-8Б - 30 м.";
        arrayPtv[9] = "Дальность водяной, сплошной струи СПРК-8Б - 40 м.";
        arrayPtv[10] = "Дальность водяной распылённой струи СПРК-8Б - 13 м.";
        arrayPtv[11] = "Дальность водяной распылённой струи СПРК-8Б - 15 м.";
        arrayPtv[12] = "Дальность пенной, сплошной струи СПРК-8Б - 14 м.";
        arrayPtv[13] = "Дальность пенной, сплошной струи СПРК-8Б - 18 м.";
        arrayPtv[14] = "Диапазон изменения угла факела распылённой струи СПРК всех типов - 0 / 110 градусов";
        arrayPtv[15] = "Диапазон изменения угла факела распылённой струи СПРК всех типов - 0 / 120 градусов";
        arrayPtv[16] = "Диаметр факела защитной завесы СПРК всех типов - 5м.";
        arrayPtv[17] = "Диаметр факела защитной завесы СПРК всех типов - 3м.";
        arrayPtv[18] = "Кратность пены на выходе комбинированного пенного насадка - 9.0";
        arrayPtv[19] = "Кратность пены на выходе комбинированного пенного насадка - 7.0";
        arrayPtv[20] = "Кратность пены на выходе съёмного пенного насадка - 90.0";
        arrayPtv[21] = "Кратность пены на выходе съёмного пенного насадка - 80.0";
        arrayPtv[22] = "Масса СПРК-8Б - 1.5 кг";
        arrayPtv[23] = "Масса СПРК-8Б - 2.5 кг";
        arrayPtv[24] = "Габариты СПРК-8Б - 260*130*280";
        arrayPtv[25] = "Габариты СПРК-8Б - 290*130*280";

        // СПРК-12
        arrayPtv[26] = "СПРК-12А: 12- максимальный расход воды л.с, \"А\"- тип присоединения, под рукавную головку ГР-70";
        arrayPtv[27] = "СПРК-12А: 12- максимальный расход воды (раствора) л.с, \"А\"- тип присоединения, под рукавную головку ГР-80";
        arrayPtv[28] = "Рабочее давление СПРК-12А составляет - 0.5 мПа";
        arrayPtv[29] = "Рабочее давление СПРК-12А составляет - 0.7 мПа";
        arrayPtv[30] = "Расход воды (раствора) СПРК-12А составляет - 2,5,6,7,10,14 л.с";
        arrayPtv[31] = "Расход воды (раствора) СПРК-12А составляет - 2,4,6,8,10,12 л.с";
        arrayPtv[32] = "Дальность водяной, сплошной струи СПРК-12А - 55 м.";
        arrayPtv[33] = "Дальность водяной, сплошной струи СПРК-12А - 50 м.";
        arrayPtv[34] = "Дальность водяной распылённой струи СПРК-12А - 10 м.";
        arrayPtv[35] = "Дальность водяной распылённой струи СПРК-12А - 20 м.";
        arrayPtv[36] = "Дальность пенной, сплошной струи СПРК-12А - 25 м.";
        arrayPtv[37] = "Дальность пенной, сплошной струи СПРК-12А - 26 м.";
        arrayPtv[38] = "Масса СПРК-12А - 4.5 кг";
        arrayPtv[39] = "Масса СПРК-12А - 3.5 кг";
        arrayPtv[40] = "Габариты СПРК-12А - 420*130*290";
        arrayPtv[41] = "Габариты СПРК-12А - 320*130*290";

        // СПРК-19
        arrayPtv[42] = "СПРК-19А-АД: 19- максимальный расход воды л.с, \"А\"- тип присоединения, под рукавную головку ГР-60, \"А\"- автоматическое измерение диаметра впрыска и поддержание постоянного давления на впрыске, \"Д\"- двойной    диапазон рабочего давления  ";
        arrayPtv[43] = "СПРК-19А-АД: 19- максимальный расход воды (раствора) л.с, \"А\"- тип присоединения, под рукавную головку ГР-80, \"А\"- автоматическое измерение диаметра впрыска и поддержание постоянного давления на впрыске, \"Д\"- двойной    диапазон рабочего давления  ";
        arrayPtv[44] = "Рабочее давление СПРК-19А-АД составляет - 0.7 мПа";
        arrayPtv[45] = "Рабочее давление СПРК-19А-АД составляет - 0.7 / 0.4 мПа";
        arrayPtv[46] = "Расход воды (раствора) СПРК-19А-АД составляет - 4.5 / 14 л.с";
        arrayPtv[47] = "Расход воды (раствора) СПРК-19А-АД составляет - 4.5-19 / 4.5-14 л.с";
        arrayPtv[48] = "Дальность водяной, сплошной струи СПРК-19А-АД - 40 м.";
        arrayPtv[49] = "Дальность водяной, сплошной струи СПРК-19А-АД - 50 м.";
        arrayPtv[50] = "Дальность водяной распылённой струи СПРК-19А-АД - 30 м.";
        arrayPtv[51] = "Дальность водяной распылённой струи СПРК-19А-АД - 20 м.";
        arrayPtv[52] = "Дальность пенной, сплошной струи СПРК-19А-АД - 24 м.";
        arrayPtv[53] = "Дальность пенной, сплошной струи СПРК-19А-АД - 26 м.";
        arrayPtv[54] = "Масса СПРК-19А-АД - 3.0 кг";
        arrayPtv[55] = "Масса СПРК-19А-АД - 3.5 кг";
        arrayPtv[56] = "Габариты СПРК-19А-АД - 310*130*290";
        arrayPtv[57] = "Габариты СПРК-19А-АД - 320*130*290";

        // СПРК-22
        arrayPtv[58] = "СПРК-22А-А: 22- максимальный расход воды л.с, \"А\"- тип присоединения, под рукавную головку ГР-60, \"А\"- автоматическое измерение диаметра впрыска и поддержание постоянного давления на впрыске";
        arrayPtv[59] = "СПРК-22А-А: 22- максимальный расход воды (раствора) л.с, \"А\"- тип присоединения, под рукавную головку ГР-80, \"А\"- автоматическое измерение диаметра впрыска и поддержание постоянного давления на впрыске";
        arrayPtv[60] = "Расход воды (раствора) СПРК-22А-А составляет - 3.5 / 22 л.с";
        arrayPtv[61] = "Расход воды (раствора) СПРК-22А-А составляет - 3.0 / 22 л.с";
        arrayPtv[62] = "Дальность водяной, сплошной струи СПРК-22А-А - 40 м.";
        arrayPtv[63] = "Дальность водяной, сплошной струи СПРК-22А-А - 50 м.";
        arrayPtv[64] = "Дальность водяной распылённой струи СПРК-22А-А - 25 м.";
        arrayPtv[65] = "Дальность водяной распылённой струи СПРК-22А-А - 20 м.";
        arrayPtv[66] = "Дальность пенной, сплошной струи СПРК-22А-А - 20 м.";
        arrayPtv[67] = "Дальность пенной, сплошной струи СПРК-22А-А - 26 м.";
        arrayPtv[68] = "Масса СПРК-22А-А - 3.0 кг";
        arrayPtv[69] = "Масса СПРК-22А-А - 3.5 кг";
        arrayPtv[70] = "Габариты СПРК-19А-АД - 315*130*295";
        arrayPtv[71] = "Габариты СПРК-19А-АД - 310*130*290";
        arrayPtv[72] = "Рабочее давление СПРК-22А-А составляет - 0.6 мПа";
        arrayPtv[73] = "Рабочее давление СПРК-22А-А составляет - 0.7 мПа";

        // Пурга
        arrayPtv[74] = "Расход воды (раствора) Пурга-100нп составляет - 100 л.с";
        arrayPtv[75] = "Расход воды (раствора) Пурга-100нп составляет - 100 +-5 л.с";
        arrayPtv[76] = "Рабочее давление Пурга-100нп составляет - 1.0 / 2.0 мПа";
        arrayPtv[77] = "Рабочее давление Пурга-100нп составляет - 1.0 / 1.2 мПа";
        arrayPtv[78] = "Дальность водяной, сплошной струи Пурга-100нп - 80 м.";
        arrayPtv[79] = "Дальность водяной, сплошной струи Пурга-100нп - 90 м.";
        arrayPtv[80] = "Дальность водяной распылённой струи Пурга-100нп - 150 м.";
        arrayPtv[81] = "Режим  распылённой струи у Пурга-100нп - отсутствует";
        arrayPtv[82] = "Дальность пенной, сплошной струи Пурга-100нп - 70 м.";
        arrayPtv[83] = "Дальность пенной, сплошной струи Пурга-100нп - 85 м.";
        arrayPtv[84] = "Кратность пены Пурга-100нп - 30.";
        arrayPtv[85] = "Кратность пены Пурга-100нп - 30 +- 5.";
        arrayPtv[86] = "Масса Пурга-100нп - 52 кг.";
        arrayPtv[87] = "Масса Пурга-100нп - 62 кг.";
        arrayPtv[88] = "УКТП Пурга-100нп - универсальное, комбинированное, тушение пожара.";
        arrayPtv[89] = "УКТП Пурга-100нп - установка комбинированного тушения пожара, с насадком пенным.";

        // ЛСП
        arrayPtv[90] = "ЛСП 40У-ов - лафетный ствол переносной, унифицированный";
        arrayPtv[91] = "ЛСП 40У-ов - лафетный ствол переносной, универсальный с осцилирующим водопенным насадком";
        arrayPtv[92] = "Рабочее давление ЛСП 40У-ов составляет - 0.4 / 2.0 мПа";
        arrayPtv[93] = "Рабочее давление ЛСП 40У-ов составляет - 0.4 / 1.0 мПа";
        arrayPtv[94] = "Расход воды ЛСП 40У-ов составляет - 30 л.с ";
        arrayPtv[95] = "Расход воды ЛСП 40У-ов составляет - 40 л.с ";
        arrayPtv[96] = "Расход расствора (пенообразователя) ЛСП 40У-ов - 20 л.с";
        arrayPtv[97] = "Расход расствора (пенообразователя) ЛСП 40У-ов - 30 л.с";
        arrayPtv[98] = "Дальность водяной, сплошной струи ЛСП 40У-ов - 70 м.";
        arrayPtv[99] = "Дальность водяной, сплошной струи ЛСП 40У-ов - 60 м.";
        arrayPtv[100] = "Дальность пенной, сплошной струи ЛСП 40У-ов - 30 м.";
        arrayPtv[101] = "Дальность пенной, сплошной струи ЛСП 40У-ов - 40 м.";
        arrayPtv[102] = "Дальность пенной, плоской струи ЛСП 40У-ов (при угле факела 30 градусов) - 30 м.";
        arrayPtv[103] = "Дальность пенной, плоской струи ЛСП 40У-ов (при угле факела 30 градусов)  - 35 м.";
        arrayPtv[104] = "Дальность водяной, распылённой струи ЛСП 40У-ов (при угле факела 30 градусов) - 30 м.";
        arrayPtv[105] = "Дальность водяной, распылённой струи ЛСП 40У-ов (при угле факела 30 градусов) - 35 м.";
        arrayPtv[106] = "Кратность пены ЛСП 40У-ов - 4.";
        arrayPtv[107] = "Кратность пены ЛСП 40У-ов - 5.";
        arrayPtv[108] = "Диапазон изменения угла факела распылённой струи ЛСП 40У-ов - 0 / 80 градусов";
        arrayPtv[109] = "Диапазон изменения угла факела распылённой струи ЛСП 40У-ов - 0 / 90 градусов";
        arrayPtv[110] = "Перемещение ствола ЛСП 40У-ов в горизонтальной плоскости - 170 градусов";
        arrayPtv[111] = "Перемещение ствола ЛСП 40У-ов в горизонтальной плоскости - 180 +- градусов";
        arrayPtv[112] = "Перемещение ствола ЛСП 40У-ов в вертикальной плоскости - 70  вверх,  7 вниз градусов";
        arrayPtv[113] = "Перемещение ствола ЛСП 40У-ов в вертикальной плоскости - 75 вверх, 8 вниз градусов";
        arrayPtv[114] = "Масса ЛСП 40У-ов - 12 кг.";
        arrayPtv[115] = "Масса ЛСП 40У-ов - 17 кг.";

    }

}
