package com.company;

public class Suot extends Questions {
    public Suot() {
        arraySuot[0] = "ЛПДС Апрельская - Линейная Перекачиваемая Диспетчерская Станция ";
        arraySuot[1] = "ЛПДС Апрельская - Линейная Производственно - Диспетчерская Станция";
        arraySuot[2] = "Диаметр нефтепровода Холмогоры-Клин - Ду 1200 ";
        arraySuot[3] = "Диаметр нефтепровода Холмогоры-Клин - Ду 1220 ";
        arraySuot[4] = "Диаметр нефтепровода Ватьёган-Апрельская - Ду 520 ";
        arraySuot[5] = "Диаметр нефтепровода Ватьёган-Апрельская - Ду 530";
        arraySuot[6] = "Диаметр нефтепровода Холмогоры-Западный Сургут - Ду 800";
        arraySuot[7] = "Диаметр нефтепровода Холмогоры-Западный Сургут - Ду 820";
        arraySuot[8] = "Диаметр нефтепровода Повх-Покачи-Урьевское - Ду 700";
        arraySuot[9] = "Диаметр нефтепровода Повх-Покачи-Урьевское - Ду 720";
        arraySuot[10] = "Земельная площадь ЛПДС Апрельская - 21 Га";
        arraySuot[11] = "Земельная площадь ЛПДС Апрельская - 22.3 Га";
        arraySuot[12] = "Максимальное давление нефти на входе НПС - 0.7 МПа";
        arraySuot[13] = "Максимальное давление нефти на входе НПС - 0.8 МПа";
        arraySuot[14] = "Максимальное давление нефти на выходе НПС - 6 МПа";
        arraySuot[15] = "Максимальное давление нефти на выходе НПС - 5 МПа";
        arraySuot[16] = "Максимальное давление нефти на входе подпорной НПС - 0.14 МПа МПа";
        arraySuot[17] = "Максимальное давление нефти на входе подпорной НПС - 0.15 МПа МПа";
        arraySuot[18] = "Максимальное давление нефти на выходе подпорной НПС - 0.5 / 0.6 МПа";
        arraySuot[19] = "Максимальное давление нефти на выходе подпорной НПС - 0.6 / 0.7 МПа";
        arraySuot[20] = "Температура нефти при перекачке - +4 / +30 *С";
        arraySuot[21] = "Температура нефти при перекачке - +4 /+35 *С";
        arraySuot[22] = "Самовоспламенение нефти происходит при температуре от - +200 *С ";
        arraySuot[23] = "Самовоспламенение нефти происходит при температуре от - +250 *С";
        arraySuot[24] = "Закипание нефти происходит при температуре от - +30 *С ";
        arraySuot[25] = "Закипание нефти происходит при температуре от - +40 *С";
        arraySuot[26] = "Застывание нефти происходит при температуре - -35 *С";
        arraySuot[27] = "Застывание нефти происходит при температуре - -38 *С";
        arraySuot[28] = "Температура пламени горящей нефти - +1000 *С";
        arraySuot[29] = "Температура пламени горящей нефти - +1100 *С";
        arraySuot[30] = "АСППТ - автономная система подслойного пенного пожаротушения";
        arraySuot[31] = "АСППТ - автоматическая система подслойного пенного пожаротушения";
        arraySuot[32] = "";
        arraySuot[33] = "";
        arraySuot[34] = "";
        arraySuot[35] = "";
    }
}
