package com.company;

public class Suot extends Questions {
    public Suot() {
        arraySuot[0] = "ЛПДС Апрельская - Линейная Перекачиваемая Диспетчерская Станция ";
        arraySuot[1] = "ЛПДС Апрельская - Линейная Производственно - Диспетчерская Станция";
        arraySuot[2] = "Диаметр нефтепровода Холмогоры-Клин - Ду 1200 ";
        arraySuot[3] = "Диаметр нефтепровода Холмогоры-Клин - Ду 1220 ";
        arraySuot[4] = "Диаметр нефтепровода Ватьёган-Апрельская - Ду 520 ";
        arraySuot[5] = "Диаметр нефтепровода Ватьёган-Апрельская - Ду 530";
        arraySuot[6] = "Диаметр нефтепровода Холмогоры-Западный Сургут - Ду 800";
        arraySuot[7] = "Диаметр нефтепровода Холмогоры-Западный Сургут - Ду 820";
        arraySuot[8] = "Диаметр нефтепровода Повх-Покачи-Урьевское - Ду 700";
        arraySuot[9] = "Диаметр нефтепровода Повх-Покачи-Урьевское - Ду 720";
        arraySuot[10] = "";
        arraySuot[11] = "";
    }
}
